Tekla Open API Reference for Tekla Structures 2025
Contour Class
 The Contour class defines a possibly chamfered contour. Contours must not have loops.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Contour
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Contour
<SerializableAttribute>
Public NotInheritable Class Contour
The Contour type exposes the following members.
Constructors
Name | Description
Contour
 Instantiates an empty contour.
Top
Properties
Name | Description
ContourPoints
 The contour points belonging to the contour.
Top
Methods
Name | Description
AddContourPoint
 Adds a new contour point to the contour. Do not add the same contour point twice.
CalculatePolygon
 Calculate a polygon approximating the contour with chamfers evaluated.
GetPolycurve
 Gets the contour geometry as Polycurve
Top
Fields
Name | Description
MAX_CONTOUR_POINTS
 The maximum number of contour points that is typically valid in Tekla Structures.
MIN_CONTOUR_POINTS
 The minimum number of contour points that is typically valid in Tekla Structures.
Top
See Also
Reference
Tekla.Structures.Model Namespace